In [3]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import inspect
import pandas as pd

sqlalchemy.__version__

'1.4.32'

In [4]:
connect_str = 'sqlite:////Users/halimaelbadoui/Documents/Ironhack/dataptmad0522_lessons/m1/datasets/publications.db'

In [5]:
engine = create_engine(connect_str)
type(engine)

sqlalchemy.engine.base.Engine

## Challenge 1 - Most Profiting Authors

In [6]:
inspector = inspect(engine)
inspector.get_table_names()

['authors',
 'discounts',
 'employee',
 'jobs',
 'pub_info',
 'publishers',
 'roysched',
 'sales',
 'stores',
 'titleauthor',
 'titles']

In [7]:
sales = pd.read_sql_query(
    "SELECT * FROM sales", engine)
sales
#imprimo la tabla de sales para saber qué columnas tengo (he impreso también titles, titleauthor cambiando la tabla)

   stor_id   ord_num             ord_date  qty    payterms title_id
0     6380      6871  1994-09-14 00:00:00    5      Net 60   BU1032
1     6380      722a  1994-09-13 00:00:00    3      Net 60   PS2091
2     7066     A2976  1993-05-24 00:00:00   50      Net 30   PC8888
3     7066  QA7442.3  1994-09-13 00:00:00   75  ON invoice   PS2091
4     7067     D4482  1994-09-14 00:00:00   10      Net 60   PS2091
5     7067     P2121  1992-06-15 00:00:00   40      Net 30   TC3218
6     7067     P2121  1992-06-15 00:00:00   20      Net 30   TC4203
7     7067     P2121  1992-06-15 00:00:00   20      Net 30   TC7777
8     7131   N914008  1994-09-14 00:00:00   20      Net 30   PS2091
9     7131   N914014  1994-09-14 00:00:00   25      Net 30   MC3021
10    7131    P3087a  1993-05-29 00:00:00   20      Net 60   PS1372
11    7131    P3087a  1993-05-29 00:00:00   25      Net 60   PS2106
12    7131    P3087a  1993-05-29 00:00:00   15      Net 60   PS3333
13    7131    P3087a  1993-05-29 00:00:00   25      Net 60   PS7777
14    7896    QQ2299  1993-10-28 00:00:00   15      Net 60   BU7832
15    7896     TQ456  1993-12-12 00:00:00   10      Net 60   MC2222
16    7896      X999  1993-02-21 00:00:00   35  ON invoice   BU2075
17    8042  423LL922  1994-09-14 00:00:00   15  ON invoice   MC3021
18    8042  423LL930  1994-09-14 00:00:00   10  ON invoice   BU1032
19    8042      P723  1993-03-11 00:00:00   25      Net 30   BU1111
20    8042   QA879.1  1993-05-22 00:00:00   30      Net 30   PC1035

In [8]:
query_1 = '''
SELECT 
s.title_id AS 'TITLE ID',
ta.au_id AS 'AUTHOR ID',
ti.advance * ta.royaltyper / 100 AS 'ADVANCE',
ti.price * s.qty * ti.royalty / 100 * ta.royaltyper / 100 AS 'ROYALTY'

FROM Sales s
LEFT JOIN titles ti ON ti.title_id = s.title_id
LEFT JOIN titleauthor ta ON ta.title_id = s.title_id
'''
#la primera query cruzo la tabla sales con la title y titleauthor y aplico las fórmulas para sacar el advance y el royalty

In [9]:
step_1 = pd.read_sql_query(query_1, engine)
step_1

   TITLE ID    AUTHOR ID  ADVANCE  ROYALTY
0    BU1032  213-46-8915     2000    3.998
1    BU1032  409-56-7008     3000    5.997
2    PS2091  899-46-2035     1137    1.971
3    PS2091  998-72-3567     1137    1.971
4    PC8888  427-17-2319     4000   50.000
5    PC8888  846-92-7186     4000   50.000
6    PS2091  899-46-2035     1137   49.275
7    PS2091  998-72-3567     1137   49.275
8    PS2091  899-46-2035     1137    6.570
9    PS2091  998-72-3567     1137    6.570
10   TC3218  807-91-6654     7000   83.800
11   TC4203  648-92-1872     4000   33.460
12   TC7777  267-41-2394     2400    8.994
13   TC7777  472-27-2349     2400    8.994
14   TC7777  672-71-3249     3200   11.992
15   PS2091  899-46-2035     1137   13.140
16   PS2091  998-72-3567     1137   13.140
17   MC3021  722-51-5454    11250   13.455
18   MC3021  899-46-2035     3750    4.485
19   PS1372  724-80-9391     1750   10.795
20   PS1372  756-30-7391     5250   32.385
21   PS2106  998-72-3567     6000   17.000
22   PS3333  172-32-1176     2000   29.985
23   PS7777  486-29-1786     4000   19.975
24   BU7832  274-80-9391     5000   29.985
25   MC2222  712-45-1867        0   23.988
26   BU2075  213-46-8915    10125   25.116
27   MC3021  722-51-5454    11250    8.073
28   MC3021  899-46-2035     3750    2.691
29   BU1032  213-46-8915     2000    7.996
30   BU1032  409-56-7008     3000   11.994
31   BU1111  267-41-2394     2000   11.950
32   BU1111  724-80-9391     3000   17.925
33   PC1035  238-95-7766     7000  110.160

In [10]:
query_2 = '''
SELECT  
    r.TITLE_ID, 
    r.AUTHOR_ID,
    SUM(r.ROYALTY) AS 'AGG_ROYALTY',
    SUM (r.ADVANCE) AS 'AGG_ADVANCE'
    FROM( SELECT 
        s.title_id AS 'TITLE_ID',
        ta.au_id AS 'AUTHOR_ID',
        ti.advance * ta.royaltyper / 100 AS 'ADVANCE',
        ti.price * s.qty * ti.royalty / 100 * ta.royaltyper / 100 AS 'ROYALTY'

        FROM Sales s
        LEFT JOIN titles ti ON ti.title_id = s.title_id
        LEFT JOIN titleauthor ta ON ta.title_id = s.title_id) r
GROUP BY r.AUTHOR_ID, r.TITLE_ID
''' 
#aquí aplico la query_1 como la subquery de la query_2 donde añado la suma del AVANCE y del ROYALTY y lo agrupo
#por el author id y por el title id

In [11]:
step_2 = pd.read_sql_query(query_2, engine)
step_2

   TITLE_ID    AUTHOR_ID  AGG_ROYALTY  AGG_ADVANCE
0    PS3333  172-32-1176       29.985         2000
1    BU1032  213-46-8915       11.994         4000
2    BU2075  213-46-8915       25.116        10125
3    PC1035  238-95-7766      110.160         7000
4    BU1111  267-41-2394       11.950         2000
5    TC7777  267-41-2394        8.994         2400
6    BU7832  274-80-9391       29.985         5000
7    BU1032  409-56-7008       17.991         6000
8    PC8888  427-17-2319       50.000         4000
9    TC7777  472-27-2349        8.994         2400
10   PS7777  486-29-1786       19.975         4000
11   TC4203  648-92-1872       33.460         4000
12   TC7777  672-71-3249       11.992         3200
13   MC2222  712-45-1867       23.988            0
14   MC3021  722-51-5454       21.528        22500
15   BU1111  724-80-9391       17.925         3000
16   PS1372  724-80-9391       10.795         1750
17   PS1372  756-30-7391       32.385         5250
18   TC3218  807-91-6654       83.800         7000
19   PC8888  846-92-7186       50.000         4000
20   MC3021  899-46-2035        7.176         7500
21   PS2091  899-46-2035       70.956         4548
22   PS2091  998-72-3567       70.956         4548
23   PS2106  998-72-3567       17.000         6000

In [12]:
query_3 = '''
SELECT
y.AUTHOR_ID,
y.AGG_ROYALTY + y.AGG_ADVANCE AS PROFIT
 
FROM (
    SELECT 
    r.TITLE_ID, 
    r.AUTHOR_ID,
    SUM(r.ROYALTY) AS 'AGG_ROYALTY',
    SUM (r.ADVANCE) AS 'AGG_ADVANCE'
    FROM( SELECT 
        s.title_id AS 'TITLE_ID',
        ta.au_id AS 'AUTHOR_ID',
        ti.advance * ta.royaltyper / 100 AS 'ADVANCE',
        ti.price * s.qty * ti.royalty / 100 * ta.royaltyper / 100 AS 'ROYALTY'

        FROM Sales s
        LEFT JOIN titles ti ON ti.title_id = s.title_id
        LEFT JOIN titleauthor ta ON ta.title_id = s.title_id) r
    GROUP BY r.AUTHOR_ID, r.TITLE_ID) y
'''

In [13]:
step_3 = pd.read_sql_query(query_3, engine)
step_3

      AUTHOR_ID     PROFIT
0   172-32-1176   2029.985
1   213-46-8915   4011.994
2   213-46-8915  10150.116
3   238-95-7766   7110.160
4   267-41-2394   2011.950
5   267-41-2394   2408.994
6   274-80-9391   5029.985
7   409-56-7008   6017.991
8   427-17-2319   4050.000
9   472-27-2349   2408.994
10  486-29-1786   4019.975
11  648-92-1872   4033.460
12  672-71-3249   3211.992
13  712-45-1867     23.988
14  722-51-5454  22521.528
15  724-80-9391   3017.925
16  724-80-9391   1760.795
17  756-30-7391   5282.385
18  807-91-6654   7083.800
19  846-92-7186   4050.000
20  899-46-2035   7507.176
21  899-46-2035   4618.956
22  998-72-3567   4618.956
23  998-72-3567   6017.000

In [14]:
query_4 = '''
SELECT
x.AUTHOR_ID AS 'AUTHOR_ID',
SUM(x.PROFIT) AS 'TOTAL_PROFIT'
FROM(
    SELECT
    y.AUTHOR_ID,
    y.AGG_ROYALTY + y.AGG_ADVANCE AS PROFIT

    FROM (
        SELECT 
        r.TITLE_ID, 
        r.AUTHOR_ID,
        SUM(r.ROYALTY) AS 'AGG_ROYALTY',
        SUM (r.ADVANCE) AS 'AGG_ADVANCE'
        FROM( SELECT 
            s.title_id AS 'TITLE_ID',
            ta.au_id AS 'AUTHOR_ID',
            ti.advance * ta.royaltyper / 100 AS 'ADVANCE',
            ti.price * s.qty * ti.royalty / 100 * ta.royaltyper / 100 AS 'ROYALTY'

            FROM Sales s
            LEFT JOIN titles ti ON ti.title_id = s.title_id
            LEFT JOIN titleauthor ta ON ta.title_id = s.title_id) r
        GROUP BY r.AUTHOR_ID, r.TITLE_ID) y
)x 
GROUP BY x.AUTHOR_ID
ORDER BY TOTAL_PROFIT DESC
LIMIT 3
'''

In [15]:
top_profit_authors = pd.read_sql_query(query_4, engine)
top_profit_authors

     AUTHOR_ID  TOTAL_PROFIT
0  722-51-5454     22521.528
1  213-46-8915     14162.110
2  899-46-2035     12126.132